
package DZ6_1;

//Основное задание
//        1. Создать класс DZ6_1.CreditCard c полями номер счета, текущая сумма на счету.
//        Добавьте метод, который позволяет начислять сумму на кредитную
//        карточку.
//        Добавьте метод, который позволяет снимать с карточки некоторую сумму.
//        Добавьте метод, который выводит текущую информацию о карточке.
//        Напишите программу, которая создает три объекта класса DZ6_1.CreditCard у
//        которых заданы номер счета и начальная сумма
//        Тестовый сценарий для проверки:
//        Положите деньги на первые две карточки и снимите с третьей.
//        Выведите на экран текущее состояние всех трех карточек.
//
//        Дополнительное задание
//        1. Создать класс для описания компьютера, в этом классе должны быть
//        поля: стоимость, модель(строковый тип), DZ6_2.RAM и DZ6_2.HDD.
//        Для полей DZ6_2.RAM и DZ6_2.HDD следует создать свои собственные классы.
//        Классы для DZ6_2.RAM и DZ6_2.HDD должны иметь конструктор по умолчанию и
//        конструктор со всеми параметрами.
//        Класс DZ6_2.RAM имеет поля "название" и "объем".
//        Класс DZ6_2.HDD имеет поля "название", "объем" и "тип" (внешний или
//        внутренний).
//        Класс Computer должен иметь два конструктора:
//        - первый - с параметрами стоимость и модель,
//        - второй - со всеми полями.
//        При создании объекта "компьютер" с помощью первого конструктора
//        должны создаваться поля DZ6_2.RAM и DZ6_2.HDD с помощью конструкторов по
//        умолчанию.
//        В каждом из классов предусмотреть методы для вывода полной
//        информации (вывод всех полей и всех значений).
//        Тестовый сценарий для проверки:
//        создать объект "компьютер 1" с помощью первого конструктора и
//        вывести информацию на экран;
//        создать объект "компьютер 2" с помощью второго конструктора и
//        вывести информацию на экран.
public class Main {
    public static void main(String[] args) {
//        Напишите программу, которая создает три объекта класса DZ6_1.CreditCard у которых заданы номер счета и начальная сумма
        CreditCard creditCard1 = new CreditCard("9999 9999 9999 9999", 1500);
        CreditCard creditCard2 = new CreditCard("8888 8888 8888 8888", 2000);
        CreditCard creditCard3 = new CreditCard("7777 7777 7777 7777", 5000);

        System.out.println("В данный момент : ");
        creditCard1.print();
        creditCard2.print();
        creditCard3.print();
        System.out.println();

        creditCard1.plus(199);
        creditCard2.plus(11);
        creditCard3.minus(400);

        creditCard1.print();
        creditCard2.print();
        creditCard3.print();
    }
}